app/controllers/games_controller.rb

  def show
    game = Game.find params[:id]
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]