app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
def create
  user = User.create(user_params)