app/controllers/users_controller.rb

  def index
    users = User.where("id <> ?", current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]